backend/views/column/index.php

SELECT * FROM `QX_columns` WHERE `id`=2
SELECT * FROM `QX_columns` WHERE `id`=1
---

               // 'enableRowClick' => true,
                'value' => function ($model, $key, $index) {
                             $column =  Columns::findOne($key);
                             $column =Columns::findOne($column->pid);