backend/controllers/ContactController.php

    protected function findModel($id)
    {
        if (($model = Contacts::findOne($id)) !== null) {
---
SELECT * FROM `qx_contacts` WHERE `Id`='6'