backend/controllers/FileController.php

INSERT INTO `QX_files` (`file_type`, `file_url`, `created_at`, `updated_at`) VALUES ('1', '14250361420001.jpg', 1475816856, 1475816856)
---
    public function actionCreate()
    {
        $model = new Files();
        $upload_form = new UploadForm();

        if ($model->load(Yii::$app->request->post())) {
            $upload_form->file = UploadedFile::getInstance($upload_form, 'file');
            if ($filename = $upload_form->upload()) {
                $model->file_url = $filename;
                $model->save();