backend/controllers/LaborController.php

INSERT INTO `qx_labor` (`name`, `sex`, `age`, `species`, `technician`, `license_number`, `address`, `phone`, `remarks`, `status`) VALUES ('æˆ‘åŽ»æ¶è¶£å‘\³', 'ç”\·', '2323', '13123', '12312312', '3123123', '12312312', '123123123', '123123123123123', 1)
---
    public function actionCreate()
    {
        $model = new Labor();

        if ($model->load(Yii::$app->request->post()) && $model->save()) {

SELECT * FROM `qx_labor` WHERE `Id`='6'
---
    protected function findModel($id)
    {
        if (($model = Labor::findOne($id)) !== null) {