backend/controllers/PostController.php

    public function actionCreate()
    {
        $model = new Posts();
        $columns = Columns::getColumn(0);
        $contents =new Contents();

        if (Yii::$app->request->post() && $this->saveContent($model,$contents,Yii::$app->request->post())) {
---
INSERT INTO `QX_posts` (`post_column_id`, `post_tiltle`, `post_subtitle`, `post_anthor`, `post_origin`, `post_image`, `post_video`, `post_link`, `post_summarize`, `post_is_top`, `post_status`, `post_sort`, `created_at`, `updated_at`) VALUES (5, '立业测试', '立业测试', '系统', '原创', '', '', '', ' 立业测试立业测试立业测试立业测试  立业测试立业测试立业测试立业测试  立业测试立业测试立业测试立业测试 立业测试立业测试立业测试立业测试', 0, 1, 1, 1476617764, 1476617764)

    public function actionUpdate($id)
    {
        $model = $this->findModel($id);
        $columns = Columns::getColumn(0);
        $contents =Contents::find()->where(['posts_id'=>$id])->one();
---
SELECT * FROM `QX_contents` WHERE `posts_id`='1'

    public function actionDelete($id)
    {
       $model = $this->findModel($id);
       $model->post_status = -1;
       $model->save();
---
UPDATE `QX_posts` SET `post_status`=-1, `updated_at`=1476960696 WHERE `id`=13

    protected function findModel($id)
    {
        if (($model = Posts::findOne($id)) !== null) {
---
SELECT * FROM `QX_posts` WHERE `id`='1'

    protected function saveContent($post,$content,$params)
    {
        $tr = Yii::$app->db->beginTransaction();
        try {
            $post->load($params);
            $post->save();
            $content->content = $params['Contents']['content'];
            $content->posts_id = $post->attributes['id'];
            if (!$content->save()) {
---
INSERT INTO `QX_posts` (`post_column_id`, `post_tiltle`, `post_subtitle`, `post_anthor`, `post_origin`, `post_image`, `post_video`, `post_link`, `post_summarize`, `post_is_top`, `post_status`, `post_sort`, `created_at`, `updated_at`) VALUES (1, 'sadasd', 'asdadd', 'asdas', '', '', '', '', '', 0, 1, 2, 1476619641, 1476619641)
INSERT INTO `QX_contents` (`content`, `posts_id`) VALUES ('<p>asdasdasdasd asdsd saas das</p>', 8)