backend/controllers/WebinfoController.php

    protected function findModel($id)
    {
        if (($model = Webinfo::findOne($id)) !== null) {
---
SELECT * FROM `QX_webinfo` WHERE `id`=1