backend/views/post/index.php

                'format'=>'raw',
                'width'=>'15%',
                'value'=>function ($model, $key, $index, $widget) {
                    return Html::label($model->column->column_name);
                },
                'filterType'=>GridView::FILTER_SELECT2,
                'filter'=>ArrayHelper::map(Columns::find()->orderBy('column_name')->asArray()->all(), 'id', 'column_name'),
---
SELECT * FROM `QX_columns` WHERE `id`=23
SELECT * FROM `QX_columns` ORDER BY `column_name`