backend/views/post/view.php

SELECT * FROM `QX_columns` WHERE `id`=3
---
                'attribute'=>'post_column_id',
                'label'=>'所属栏目',
                'format'=>'raw',
                'value'=>$model->column->column_name,