backend/models/Columns.php

SELECT * FROM `QX_columns` WHERE `pid`=0
---
    public static function getColumn($id=0,&$columns=array(),$spac=0)
    {
        $spac =$spac + 1;
        $column = static::find()->where(['pid'=>$id])->all();